tests/performance/artillery-test2.yml
config:
  target: "https://www.saucedemo.com"
  phases:
    - duration: 30
      arrivalRate: 5
  processor: "./customLogic.mjs"

scenarios:
  - name: "Dynamic Login With test data"
    flow:
      - post:
          url: "/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"